products= [
    {
        "Продукт": "Брынза (сыр из коровьего молока)",
        "Тип": "Молочные продукты",
        "Белки": 17.9,
        "Жиры": 20.1,
        "Углеводы": 0.0,
        "Каллорийность": 260
    },
    {
        "Продукт": "Йогурт натуральный. 2% жир.",
        "Тип": "Молочные продукты",
        "Белки": 4.3,
        "Жиры": 2,
        "Углеводы": 6.2,
        "Каллорийность": 60
    },
    {
        "Продукт": "Кефир 3.2% жирный",
        "Тип": "Молочные продукты",
        "Белки": 2.8,
        "Жиры": 3.2,
        "Углеводы": 4.1,
        "Каллорийность": 56
    },
    {
        "Продукт": "Кефир 1% нежирный",
        "Тип": "Молочные продукты",
        "Белки": 2.8,
        "Жиры": 1,
        "Углеводы": 4,
        "Каллорийность": 40
    },
    {
        "Продукт": "Молоко 3.2%",
        "Тип": "Молочные продукты",
        "Белки": 2.9,
        "Жиры": 3.2,
        "Углеводы": 4.7,
        "Каллорийность": 59
    },
    {
        "Продукт": "Молоко 2.5%",
        "Тип": "Молочные продукты",
        "Белки": 2.8,
        "Жиры": 2.5,
        "Углеводы": 4.7,
        "Каллорийность": 52
    },
    {
        "Продукт": "Молоко сгущенное без сахара",
        "Тип": "Молочные продукты",
        "Белки": 6.6,
        "Жиры": 7.5,
        "Углеводы": 9.4,
        "Каллорийность": 131
    },
    {
        "Продукт": "Молоко сгущённое с сахаром",
        "Тип": "Молочные продукты",
        "Белки": 7.2,
        "Жиры": 8.5,
        "Углеводы": 56,
        "Каллорийность": 320
    },
    {
        "Продукт": "Молоко сухое цельное",
        "Тип": "Молочные продукты",
        "Белки": 26,
        "Жиры": 25,
        "Углеводы": 37.5,
        "Каллорийность": 476
    },
    {
        "Продукт": "Ряженка 2.5%",
        "Тип": "Молочные продукты",
        "Белки": 2.9,
        "Жиры": 2.5,
        "Углеводы": 4.2,
        "Каллорийность": 54
    },
    {
        "Продукт": "Сливки 10% (нежирные)",
        "Тип": "Молочные продукты",
        "Белки": 3,
        "Жиры": 10,
        "Углеводы": 4,
        "Каллорийность": 118
    },
    {
        "Продукт": "Сливки 20% (средней жирности)",
        "Тип": "Молочные продукты",
        "Белки": 2.8,
        "Жиры": 20,
        "Углеводы": 3.7,
        "Каллорийность": 205
    },
    {
        "Продукт": "Сметана 10% (нежирная)",
        "Тип": "Молочные продукты",
        "Белки": 3,
        "Жиры": 10,
        "Углеводы": 2.9,
        "Каллорийность": 115
    },
    {
        "Продукт": "Сметана 20% (средней жирности)",
        "Тип": "Молочные продукты",
        "Белки": 2.8,
        "Жиры": 20,
        "Углеводы": 3.2,
        "Каллорийность": 206
    },
    {
        "Продукт": "Сыр голландский",
        "Тип": "Молочные продукты",
        "Белки": 26,
        "Жиры": 26.8,
        "Углеводы": 0.0,
        "Каллорийность": 352
    },
    {
        "Продукт": "Сыр плавленый",
        "Тип": "Молочные продукты",
        "Белки": 16.8,
        "Жиры": 11.2,
        "Углеводы": 23.8,
        "Каллорийность": 257
    },
    {
        "Продукт": "Сыр российский",
        "Тип": "Молочные продукты",
        "Белки": 24.1,
        "Жиры": 29.5,
        "Углеводы": 0.3,
        "Каллорийность": 363
    },
    {
        "Продукт": "Сыр швейцарский",
        "Тип": "Молочные продукты",
        "Белки": 24.9,
        "Жиры": 31.8,
        "Углеводы": 0.0,
        "Каллорийность": 396
    },
    {
        "Продукт": "Творожная масса",
        "Тип": "Молочные продукты",
        "Белки": 7.1,
        "Жиры": 23,
        "Углеводы": 27.5,
        "Каллорийность": 341
    },
    {
        "Продукт": "Творог обезжиренный",
        "Тип": "Молочные продукты",
        "Белки": 16.5,
        "Жиры": 0.0,
        "Углеводы": 1.3,
        "Каллорийность": 71
    },
    {
        "Продукт": "Творог 9% полужирный",
        "Тип": "Молочные продукты",
        "Белки": 16.7,
        "Жиры": 9,
        "Углеводы": 2,
        "Каллорийность": 159
    },
    {
        "Продукт": "Баранки",
        "Тип": "Хлебобулочные изделия",
        "Белки": 16,
        "Жиры": 1,
        "Углеводы": 70,
        "Каллорийность": 366
    },
{
        "Продукт": "Баранки",
        "Тип": "Хлебобулочные изделия",
        "Белки": 16,
        "Жиры": 1,
        "Углеводы": 70,
        "Каллорийность": 366
    },
    {
        "Продукт": "Батон нарезной",
        "Тип": "Хлебобулочные изделия",
        "Белки": 7.5,
        "Жиры": 2.6,
        "Углеводы": 50.9,
        "Каллорийность": 264
    },
    {
        "Продукт": "Бублики",
        "Тип": "Хлебобулочные изделия",
        "Белки": 10.4,
        "Жиры": 1.3,
        "Углеводы": 69.7,
        "Каллорийность": 330
    },
    {
        "Продукт": "Булка сдобная",
        "Тип": "Хлебобулочные изделия",
        "Белки": 7.6,
        "Жиры": 6.2,
        "Углеводы": 51.5,
        "Каллорийность": 298
    },
    {
        "Продукт": "Ватрушка с творогом",
        "Тип": "Хлебобулочные изделия",
        "Белки": 7.9,
        "Жиры": 11.8,
        "Углеводы": 38.1,
        "Каллорийность": 293
    },
    {
        "Продукт": "Лаваш",
        "Тип": "Хлебобулочные изделия",
        "Белки": 8.1,
        "Жиры": 1.2,
        "Углеводы": 57.1,
        "Каллорийность": 278
    },
    {
        "Продукт": "Пирог с яблоками",
        "Тип": "Хлебобулочные изделия",
        "Белки": 2.2,
        "Жиры": 12.4,
        "Углеводы": 34.5,
        "Каллорийность": 265
    },
    {
        "Продукт": "Пирожное 'Картошка'",
        "Тип": "Хлебобулочные изделия",
        "Белки": 3.8,
        "Жиры": 22.6,
        "Углеводы": 47.0,
        "Каллорийность": 407
    },
    {
        "Продукт": "Пицца с грибами и сыром",
        "Тип": "Хлебобулочные изделия",
        "Белки": 10.1,
        "Жиры": 4.4,
        "Углеводы": 29.6,
        "Каллорийность": 233
    },
    {
        "Продукт": "Сушки",
        "Тип": "Хлебобулочные изделия",
        "Белки": 11.0,
        "Жиры": 1.3,
        "Углеводы": 74.9,
        "Каллорийность": 341
    },
    {
        "Продукт": "Геркулес",
        "Тип": "Крупы",
        "Белки": 6.2,
        "Жиры": 61,
        "Углеводы": 352,
		"Каллорийность": 12.5
    },
    {
        "Продукт": "Гречневая крупа (продел)",
        "Тип": "Крупы",
        "Белки": 2.3,
        "Жиры": 65.9,
        "Углеводы": 306,
		"Каллорийность": 9.5
    },
    {
        "Продукт": "Гречневая крупа ядрица (гречка)",
        "Тип": "Крупы",
        "Белки": 3.3,
        "Жиры": 62.1,
        "Углеводы": 313,
		"Каллорийность": 12.6
    },
    {
        "Продукт": "Кукурузная крупа",
        "Тип": "Крупы",
        "Белки": 1.2,
        "Жиры": 75,
        "Углеводы": 337,
		"Каллорийность": 8.3
    },
    {
        "Продукт": "Манная крупа",
        "Тип": "Крупы",
        "Белки": 1,
        "Жиры": 67.4,
        "Углеводы": 328,
		"Каллорийность": 321
    },
    {
        "Продукт": "Овсяная крупа",
        "Тип": "Крупы",
        "Белки": 6.1,
        "Жиры": 59.5,
        "Углеводы": 342,
		"Каллорийность": 321
    },
    {
        "Продукт": "Перловая крупа",
        "Тип": "Крупы",
        "Белки": 1.1,
        "Жиры": 73.7,
        "Углеводы": 320,
		"Каллорийность": 333
    },
    {
        "Продукт": "Пшеничная крупа",
        "Тип": "Крупы",
        "Белки": 1.3,
        "Жиры": 62,
        "Углеводы": 316,
		"Каллорийность": 232
    },
    {
        "Продукт": "Пшенная крупа",
        "Тип": "Крупы",
        
        "Белки": 3.3,
        "Жиры": 69.3,
        "Углеводы": 348,
		"Каллорийность": 135
    },
    {
        "Продукт": "Рис белый",
        "Тип": "Крупы",
        "Белки": 0.7,
        "Жиры": 78.9,
        "Углеводы": 344,
		"Каллорийность": 125
    },
    {
        "Продукт": "Толокно",
        "Тип": "Крупы",
        
        "Белки": 6,
        "Жиры": 64.9,
        "Углеводы": 363,
		"Каллорийность": 142
    },
    {
        "Продукт": "Ячневая",
        "Тип": "Крупы",
        
        "Белки": 1.3,
        "Жиры": 66.3,
        "Углеводы": 324,
		"Каллорийность": 107
    },
    {
        "Продукт": "Баклажан",
        "Тип": "Овощи",
        
        "Белки": 0.1,
        "Жиры": 4.5,
        "Углеводы": 24,
		"Каллорийность": 1.2
    },
    {
        "Продукт": "Брюква",
        "Тип": "Овощи",
        
        "Белки": 0.1,
        "Жиры": 7.7,
        "Углеводы": 37,
		"Каллорийность": 1.2
    },
    {
        "Продукт": "Горошек зеленый",
        "Тип": "Овощи",
        
        "Белки": 0.2,
        "Жиры": 13.8,
        "Углеводы": 73,
		"Каллорийность": 5
    },
    {
        "Продукт": "Зеленая фасоль",
        "Тип": "Овощи",
        "Белки": 0.0,
        "Жиры": 4.3,
        "Углеводы": 32,
		"Каллорийность": 60
    },
    {
        "Продукт": "Кабачки",
        "Тип": "Овощи",
        "Белки": 0.3,
        "Жиры": 4.6,
        "Углеводы": 24,
		"Каллорийность": 0.6
    },
    {
        "Продукт": "Капуста белокочанная",
        "Тип": "Овощи",
        "Белки": 0.1,
        "Жиры": 4.7,
        "Углеводы": 27,
		"Каллорийность": 1.8
    },
    {
        "Продукт": "Капуста краснокочанная",
        "Тип": "Овощи",
        
        "Белки": 0.0,
        "Жиры": 7.6,
        "Углеводы": 24,
		"Каллорийность": 1.8
    },
    {
        "Продукт": "Капуста цветная",
        "Тип": "Овощи",
        
        "Белки": 0.3,
        "Жиры": 5.4,
        "Углеводы": 30,
		"Каллорийность": 2.5
    },
    {
        "Продукт": "Картофель",
        "Тип": "Овощи",
        "Белки": 0.4,
        "Жиры": 16.1,
        "Углеводы": 76,
		        "Каллорийность": 2,
    },
    {
        "Продукт": "Лук зеленый (перо)",
        "Тип": "Овощи",
        "Белки": 0.0,
        "Жиры": 4.6,
        "Углеводы": 19,
		"Каллорийность": 1.3
    },
    {
        "Продукт": "Лук порей",
        "Тип": "Овощи",
        "Белки": 0.0,
        "Жиры": 8.2,
        "Углеводы": 33,
		"Каллорийность": 1.4
    },
    {
        "Продукт": "Лук репчатый",
        "Тип": "Овощи",
        
        "Белки": 0.0,
        "Жиры": 10.4,
        "Углеводы": 47,
		"Каллорийность": 1.4
    },
    {
        "Продукт": "Морковь",
        "Тип": "Овощи",
        
        "Белки": 0.1,
        "Жиры": 6.9,
        "Углеводы": 32,
		"Каллорийность": 1.3
    },
    {
        "Продукт": "Огурцы грунтовые",
        "Тип": "Овощи",
        
        "Белки": 0.1,
        "Жиры": 2.8,
        "Углеводы": 15,
		"Каллорийность": 0.8
    },
    {
        "Продукт": "Огурцы парниковые",
        "Тип": "Овощи",
        
        "Белки": 0.0,
        "Жиры": 1.8,
        "Углеводы": 10,
		"Каллорийность": 0.7
    },
	{
        "Продукт": "Ананас",
        "Тип": "Фрукты",
        "Белки": 0.4,
        "Жиры": 0.0,
        "Углеводы": 10.6,
        "Каллорийность": 49
    },
    {
        "Продукт": "Бананы",
        "Тип": "Фрукты",
        "Белки": 1.5,
        "Жиры": 0.0,
        "Углеводы": 21.8,
        "Каллорийность": 95
    },
	{
        "Продукт": "Вишня",
        "Тип": "Фрукты",
        "Белки": 0.8,
        "Жиры": 0.0,
        "Углеводы": 11.3,
        "Каллорийность": 49
    },
    {
        "Продукт": "Гранат",
        "Тип": "Фрукты",
        "Белки": 0.9,
        "Жиры": 0.0,
        "Углеводы": 11.8,
        "Каллорийность": 52
    },
    {
        "Продукт": "Груша",
        "Тип": "Фрукты",
        "Белки": 0.4,
        "Жиры": 0.0,
        "Углеводы": 10.7,
        "Каллорийность": 42
    },
    {
        "Продукт": "Инжир",
        "Тип": "Фрукты",
        "Белки": 0.7,
        "Жиры": 0.0,
        "Углеводы": 13.9,
        "Каллорийность": 56
    },
	{
        "Продукт": "Персики",
        "Тип": "Фрукты",
        "Белки": 0.9,
        "Жиры": 0.0,
        "Углеводы": 10.4,
        "Каллорийность": 44
    },
    {
        "Продукт": "Слива садовая",
        "Тип": "Фрукты",
        "Белки": 0.8,
        "Жиры": 0.0,
        "Углеводы": 9.9,
        "Каллорийность": 43
    },
    {
        "Продукт": "Черешня",
        "Тип": "Фрукты",
        "Белки": 1.1,
        "Жиры": 0.0,
        "Углеводы": 12.3,
        "Каллорийность": 52
    },
    {
        "Продукт": "Яблоки",
        "Тип": "Фрукты",
        "Белки": 0.4,
        "Жиры": 0.0,
        "Углеводы": 11.3,
        "Каллорийность": 46
    },
    {
        "Продукт": "Апельсин",
        "Тип": "Фрукты",
        "Белки": 0.9,
        "Жиры": 0.0,
        "Углеводы": 8.4,
        "Каллорийность": 38
    },
    {
        "Продукт": "Грейпфрут",
        "Тип": "Фрукты",
        "Белки": 0.9,
        "Жиры": 0.0,
        "Углеводы": 7.3,
        "Каллорийность": 35
    },
    {
        "Продукт": "Лимон",
        "Тип": "Фрукты",
        "Белки": 0.9,
        "Жиры": 0.0,
        "Углеводы": 3.6,
        "Каллорийность": 31
    },
    {
        "Продукт": "Мандарин",
        "Тип": "Фрукты",
        "Белки": 0.8,
        "Жиры": 0.0,
        "Углеводы": 8.6,
        "Каллорийность": 38
    },
    {
        "Продукт": "Виноград",
        "Тип": "Фрукты",
        "Белки": 0.4,
        "Жиры": 0.0,
        "Углеводы": 17.5,
        "Каллорийность": 69
    },
    {
        "Продукт": "Ежевика",
        "Тип": "Фрукты",
        "Белки": 2,
        "Жиры": 0.0,
        "Углеводы": 5.3,
        "Каллорийность": 33
    },
    {
        "Продукт": "Земляника",
        "Тип": "Фрукты",
        "Белки": 1.8,
        "Жиры": 0.0,
        "Углеводы": 8.1,
        "Каллорийность": 41
    },
    {
        "Продукт": "Клюква",
        "Тип": "Фрукты",
        "Белки": 0.5,
        "Жиры": 0.0,
        "Углеводы": 4.8,
        "Каллорийность": 28
    },
    {
        "Продукт": "Крыжовник",
        "Тип": "Фрукты",
        "Белки": 0.7,
        "Жиры": 0.0,
        "Углеводы": 9.9,
        "Каллорийность": 44
    },
    {
        "Продукт": "Малина",
        "Тип": "Фрукты",
        "Белки": 0.8,
        "Жиры": 0.0,
        "Углеводы": 9,
        "Каллорийность": 41
    },
    {
        "Продукт": "Смородина белая",
        "Тип": "Фрукты",
        "Белки": 0.3,
        "Жиры": 0.0,
        "Углеводы": 8.7,
        "Каллорийность": 39
    },
    {
        "Продукт": "Смородина черная",
        "Тип": "Фрукты",
        "Белки": 1.0,
        "Жиры": 0.0,
        "Углеводы": 8.0,
        "Каллорийность": 40
    },
	{
        "Продукт": "Баранина",
        "Тип": "Мясо",
        "Белки": 16.3,
        "Жиры": 15.3,
        "Углеводы": 0.0,
        "Каллорийность": 203
    },
    {
        "Продукт": "Говядина",
        "Тип": "Мясо",
        "Белки": 18.9,
        "Жиры": 12.4,
        "Углеводы": 0.0,
        "Каллорийность": 187
    },
	{
        "Продукт": "Свинина",
        "Тип": "Мясо",
        "Белки": 21.6,
        "Жиры": 20.8,
        "Углеводы": 0.0,
        "Каллорийность": 259
    },
    {
        "Продукт": "Курица",
        "Тип": "Мясо",
        "Белки": 23.1,
        "Жиры": 1.2,
        "Углеводы": 0.0,
        "Каллорийность": 110
    },
    {
        "Продукт": "Индейка",
        "Тип": "Мясо",
        "Белки": 19.2,
        "Жиры": 0.7,
        "Углеводы": 0.0,
        "Каллорийность": 84
    },
    {
        "Продукт": "Утка",
        "Тип": "Мясо",
        "Белки": 16.5,
        "Жиры": 61.2,
        "Углеводы": 0.0,
        "Каллорийность": 337
    },
    {
        "Продукт": "Гусь",
        "Тип": "Мясо",
        "Белки": 29.2,
        "Жиры": 12.7,
        "Углеводы": 0.0,
        "Каллорийность": 212
    },
    {
        "Продукт": "Кролик",
        "Тип": "Мясо",
        "Белки": 20.7,
        "Жиры": 12.9,
        "Углеводы": 0.0,
        "Каллорийность": 198
    },
	{
        "Продукт": "Конина",
        "Тип": "Мясо",
        "Белки": 20.2,
        "Жиры": 7.0,
        "Углеводы": 0.0,
        "Каллорийность": 143
    },
    {
        "Продукт": "Оленина",
        "Тип": "Мясо",
        "Белки": 22.6,
        "Жиры": 8.3,
        "Углеводы": 0.0,
        "Каллорийность": 158
    },
    {
        "Продукт": "Страус",
        "Тип": "Мясо",
        "Белки": 21.9,
        "Жиры": 2.8,
        "Углеводы": 0.0,
        "Каллорийность": 114
    },
    {
        "Продукт": "Лосятина",
        "Тип": "Мясо",
        "Белки": 21.4,
        "Жиры": 1.0,
        "Углеводы": 0.0,
        "Каллорийность": 99
    },
    {
        "Продукт": "Бизон",
        "Тип": "Мясо",
        "Белки": 21.7,
        "Жиры": 2.42,
        "Углеводы": 0.0,
        "Каллорийность": 109
    }
]